itsneeraj18/TI_C2000/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28004x" --part "F28004x_100PZ" --package "F28004x_100PZ" --context "system" --product "C2000WARE@5.03.00.00"
 * @v2CliArgs --device "TMS320F280049C" --package "100PZ" --context "system" --product "C2000WARE@5.03.00.00"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const epwm  = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1 = epwm.addInstance();
const gpio  = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1 = gpio.addInstance();
const gpio2 = gpio.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
epwm1.$name                                = "myEPWM0";
epwm1.epwmTimebase_counterMode             = "EPWM_COUNTER_MODE_UP";
epwm1.epwmEventTrigger_enableInterrupt     = true;
epwm1.epwmEventTrigger_interruptEventCount = "1";
epwm1.epwmEventTrigger_interruptSource     = "EPWM_INT_TBCTR_PERIOD";
epwm1.epwmEventTrigger_registerInterrupts  = true;
epwm1.epwmCounterCompare_cmpA              = 599;
epwm1.epwmTimebase_clockDiv                = "EPWM_CLOCK_DIVIDER_128";
epwm1.epwmTimebase_hsClockDiv              = "EPWM_HSCLOCK_DIVIDER_14";
epwm1.epwmTimebase_period                  = 55802;

gpio1.$name           = "LED_GREEN";
gpio1.direction       = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign = "GPIO34";

gpio2.$name           = "LED_RED";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "GPIO23_VSW";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.epwm.$suggestSolution           = "EPWM1";
epwm1.epwm.epwm_aPin.$suggestSolution = "GPIO0";
epwm1.epwm.epwm_bPin.$suggestSolution = "GPIO1";
